const a = "змінна а g";
const d = "змінна d g";

if (true) {
  const b = "змінна b 1";
  console.log(a);
  console.log(b);
  const d = "змінна d 1";
  if (true) {
    const c = "змінна с 2";
    console.log(c);
    console.log(d);
  }
}
console.log(a);

//Напиши скрипт вибору готеля по
//кількості зірок.
//1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
// Якщо в змінній stars щось окрім
//чисел 1 - 5, виведи рядок
// 'Токої кількості зірок нема

// const stars = parseInt(prompt("Оберіть готель по кількості зірок"));
// switch (stars) {
//   case 1:
//     alert("Готель коштує 20$");
//     break;
//   case 2:
//     alert("Готель коштує 30$");
//     break;
//   case 3:
//     alert("Готель коштує 50$");
//     break;
//   case 4:
//     alert("Готель коштує 70$");
//     break;
//   case 5:
//     alert("Готель коштує 120$");
//     break;
//   default:
//     alert("Токої кількості зірок нема");
// }

//Напиши скрипт вибору опції доставки товару.
//Опція зберігається в змінній option: 1 - самовивіз,
//2 - кур"єр, 3 - пошта. В змінну message записати
//повідомлення в залежності від опції.
// - 'Ви зможете забрати товар завтра з 12:00
//в нашому офісі'
// - 'Кур"єр доставить замовлення завтра з
//9:00 до 18:00'

const option = parseInt(
  prompt("Оберіть спосіб доставки: 1 - самовивіз, 2 - кур'єр, 3 - пошта.")
);
let message = "";
// * Тернарний оператор розгалуження
message =
  option === 1
    ? "Ви зможете забрати товар завтра з 12:00 в нашому офісі"
    : option === 2
    ? "Кур'єр доставить замовлення завтра з 9:00 до 18:00"
    : option === 3
    ? "Ви зможете забрати замовлення на пошті"
    : "Такого способу доставки нема";
alert(message);
// * Switch оператор розгалуження
switch (option) {
  case 1:
    message = "Ви зможете забрати товар завтра з 12:00 в нашому офісі";
    break;
  case 2:
    message = "Кур'єр доставить замовлення завтра з 9:00 до 18:00";
    break;
  case 3:
    message = "Ви зможете забрати замовлення на пошті";
    break;
  default:
    message = "Такого способу доставки нема";
}
alert(message);
